#include "drawattribute.h"

void knife(void) {
    glPushMatrix();
    glScalef(0.1,0.1,0.1);
    glBegin(GL_QUADS);
    glColor3ub(0, 0, 0);
    glVertex2d(0.48, 0.5); // Левая нижняя вершина
    glVertex2d(0.44, 0.5); // Правая нижняя вершина
    glVertex2d(0.44, 0.54); // Правая верхняя вершина
    glVertex2d(0.48, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.44, 0.5); // Левая нижняя вершина
    glVertex2d(0.4, 0.5); // Правая нижняя вершина
    glVertex2d(0.4, 0.54); // Правая верхняя вершина
    glVertex2d(0.44, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.4, 0.5); // Левая нижняя вершина
    glVertex2d(0.36, 0.5); // Правая нижняя вершина
    glVertex2d(0.36, 0.54); // Правая верхняя вершина
    glVertex2d(0.4, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.36, 0.5); // Левая нижняя вершина
    glVertex2d(0.32, 0.5); // Правая нижняя вершина
    glVertex2d(0.32, 0.54); // Правая верхняя вершина
    glVertex2d(0.36, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.32, 0.5); // Левая нижняя вершина
    glVertex2d(0.28, 0.5); // Правая нижняя вершина
    glVertex2d(0.28, 0.54); // Правая верхняя вершина
    glVertex2d(0.32, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.28, 0.5); // Левая нижняя вершина
    glVertex2d(0.24, 0.5); // Правая нижняя вершина
    glVertex2d(0.24, 0.54); // Правая верхняя вершина
    glVertex2d(0.28, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.24, 0.5); // Левая нижняя вершина
    glVertex2d(0.2, 0.5); // Правая нижняя вершина
    glVertex2d(0.2, 0.54); // Правая верхняя вершина
    glVertex2d(0.24, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.2, 0.5); // Левая нижняя вершина
    glVertex2d(0.16, 0.5); // Правая нижняя вершина
    glVertex2d(0.16, 0.54); // Правая верхняя вершина
    glVertex2d(0.2, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.16, 0.5); // Левая нижняя вершина
    glVertex2d(0.12, 0.5); // Правая нижняя вершина
    glVertex2d(0.12, 0.54); // Правая верхняя вершина
    glVertex2d(0.16, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.12, 0.5); // Левая нижняя вершина
    glVertex2d(0.08, 0.5); // Правая нижняя вершина
    glVertex2d(0.08, 0.54); // Правая верхняя вершина
    glVertex2d(0.12, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.08, 0.5); // Левая нижняя вершина
    glVertex2d(0.04, 0.5); // Правая нижняя вершина
    glVertex2d(0.04, 0.54); // Правая верхняя вершина
    glVertex2d(0.08, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.04, 0.5); // Левая нижняя вершина
    glVertex2d(0, 0.5); // Правая нижняя вершина
    glVertex2d(0, 0.54); // Правая верхняя вершина
    glVertex2d(0.04, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0, 0.5); // Левая нижняя вершина
    glVertex2d(-0.04, 0.5); // Правая нижняя вершина
    glVertex2d(-0.04, 0.54); // Правая верхняя вершина
    glVertex2d(0, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.04, 0.5); // Левая нижняя вершина
    glVertex2d(-0.08, 0.5); // Правая нижняя вершина
    glVertex2d(-0.08, 0.54); // Правая верхняя вершина
    glVertex2d(-0.04, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.08, 0.5); // Левая нижняя вершина
    glVertex2d(-0.12, 0.5); // Правая нижняя вершина
    glVertex2d(-0.12, 0.54); // Правая верхняя вершина
    glVertex2d(-0.08, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.12, 0.5); // Левая нижняя вершина
    glVertex2d(-0.16, 0.5); // Правая нижняя вершина
    glVertex2d(-0.16, 0.54); // Правая верхняя вершина
    glVertex2d(-0.12, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.16, 0.5); // Левая нижняя вершина
    glVertex2d(-0.2, 0.5); // Правая нижняя вершина
    glVertex2d(-0.2, 0.54); // Правая верхняя вершина
    glVertex2d(-0.16, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.2, 0.5); // Левая нижняя вершина
    glVertex2d(-0.24, 0.5); // Правая нижняя вершина
    glVertex2d(-0.24, 0.54); // Правая верхняя вершина
    glVertex2d(-0.2, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.24, 0.5); // Левая нижняя вершина
    glVertex2d(-0.28, 0.5); // Правая нижняя вершина
    glVertex2d(-0.28, 0.54); // Правая верхняя вершина
    glVertex2d(-0.24, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.24, 0.54); // Левая нижняя вершина
    glVertex2d(-0.28, 0.54); // Правая нижняя вершина
    glVertex2d(-0.28, 0.58); // Правая верхняя вершина
    glVertex2d(-0.24, 0.58); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.28, 0.5); // Левая нижняя вершина
    glVertex2d(-0.32, 0.5); // Правая нижняя вершина
    glVertex2d(-0.32, 0.54); // Правая верхняя вершина
    glVertex2d(-0.28, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.32, 0.5); // Левая нижняя вершина
    glVertex2d(-0.36, 0.5); // Правая нижняя вершина
    glVertex2d(-0.36, 0.54); // Правая верхняя вершина
    glVertex2d(-0.32, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.36, 0.5); // Левая нижняя вершина
    glVertex2d(-0.32, 0.5); // Правая нижняя вершина
    glVertex2d(-0.32, 0.54); // Правая верхняя вершина
    glVertex2d(-0.36, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.4, 0.5); // Левая нижняя вершина
    glVertex2d(-0.36, 0.5); // Правая нижняя вершина
    glVertex2d(-0.36, 0.54); // Правая верхняя вершина
    glVertex2d(-0.4, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.44, 0.5); // Левая нижняя вершина
    glVertex2d(-0.4, 0.5); // Правая нижняя вершина
    glVertex2d(-0.4, 0.54); // Правая верхняя вершина
    glVertex2d(-0.44, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.48, 0.5); // Левая нижняя вершина
    glVertex2d(-0.44, 0.5); // Правая нижняя вершина
    glVertex2d(-0.44, 0.54); // Правая верхняя вершина
    glVertex2d(-0.48, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.52, 0.5); // Левая нижняя вершина
    glVertex2d(-0.48, 0.5); // Правая нижняя вершина
    glVertex2d(-0.48, 0.54); // Правая верхняя вершина
    glVertex2d(-0.52, 0.54); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.44, 0.46); // Левая нижняя вершина
    glVertex2d(0.4, 0.46); // Правая нижняя вершина
    glVertex2d(0.4, 0.5); // Правая верхняя вершина
    glVertex2d(0.44, 0.5); // Левая верхняя вершина

    glColor3ub(190,190,190);
    glVertex2d(0.4, 0.46); // Левая нижняя вершина
    glVertex2d(0.36, 0.46); // Правая нижняя вершина
    glVertex2d(0.36, 0.5); // Правая верхняя вершина
    glVertex2d(0.4, 0.5); // Левая верхняя вершина

    glColor3ub(225,225,225);
    glVertex2d(0.36, 0.46); // Левая нижняя вершина
    glVertex2d(0.32, 0.46); // Правая нижняя вершина
    glVertex2d(0.32, 0.5); // Правая верхняя вершина
    glVertex2d(0.36, 0.5); // Левая верхняя вершина

    glColor3ub(225,225,225);
    glVertex2d(0.32, 0.46); // Левая нижняя вершина
    glVertex2d(0.28, 0.46); // Правая нижняя вершина
    glVertex2d(0.28, 0.5); // Правая верхняя вершина
    glVertex2d(0.32, 0.5); // Левая верхняя вершина

    glColor3ub(225,225,225);
    glVertex2d(0.28, 0.46); // Левая нижняя вершина
    glVertex2d(0.24, 0.46); // Правая нижняя вершина
    glVertex2d(0.24, 0.5); // Правая верхняя вершина
    glVertex2d(0.28, 0.5); // Левая верхняя вершина

    glColor3ub(225,225,225);
    glVertex2d(0.24, 0.46); // Левая нижняя вершина
    glVertex2d(0.2, 0.46); // Правая нижняя вершина
    glVertex2d(0.2, 0.5); // Правая верхняя вершина
    glVertex2d(0.24, 0.5); // Левая верхняя вершина

    glColor3ub(225,225,225);
    glVertex2d(0.2, 0.46); // Левая нижняя вершина
    glVertex2d(0.16, 0.46); // Правая нижняя вершина
    glVertex2d(0.16, 0.5); // Правая верхняя вершина
    glVertex2d(0.2, 0.5); // Левая верхняя вершина

    glColor3ub(225,225,225);
    glVertex2d(0.16, 0.46); // Левая нижняя вершина
    glVertex2d(0.12, 0.46); // Правая нижняя вершина
    glVertex2d(0.12, 0.5); // Правая верхняя вершина
    glVertex2d(0.16, 0.5); // Левая верхняя вершина

    glColor3ub(225,225,225);
    glVertex2d(0.12, 0.46); // Левая нижняя вершина
    glVertex2d(0.08, 0.46); // Правая нижняя вершина
    glVertex2d(0.08, 0.5); // Правая верхняя вершина
    glVertex2d(0.12, 0.5); // Левая верхняя вершина

    glColor3ub(225,225,225);
    glVertex2d(0.08, 0.46); // Левая нижняя вершина
    glVertex2d(0.04, 0.46); // Правая нижняя вершина
    glVertex2d(0.04, 0.5); // Правая верхняя вершина
    glVertex2d(0.08, 0.5); // Левая верхняя вершина

    glColor3ub(225,225,225);
    glVertex2d(0.04, 0.46); // Левая нижняя вершина
    glVertex2d(0, 0.46); // Правая нижняя вершина
    glVertex2d(0, 0.5); // Правая верхняя вершина
    glVertex2d(0.04, 0.5); // Левая верхняя вершина

    glColor3ub(225,225,225);
    glVertex2d(0, 0.46); // Левая нижняя вершина
    glVertex2d(-0.04, 0.46); // Правая нижняя вершина
    glVertex2d(-0.04, 0.5); // Правая верхняя вершина
    glVertex2d(0, 0.5); // Левая верхняя вершина

    glColor3ub(225,225,225);
    glVertex2d(-0.04, 0.46); // Левая нижняя вершина
    glVertex2d(-0.08, 0.46); // Правая нижняя вершина
    glVertex2d(-0.08, 0.5); // Правая верхняя вершина
    glVertex2d(-0.04, 0.5); // Левая верхняя вершина

    glColor3ub(225,225,225);
    glVertex2d(-0.08, 0.46); // Левая нижняя вершина
    glVertex2d(-0.12, 0.46); // Правая нижняя вершина
    glVertex2d(-0.12, 0.5); // Правая верхняя вершина
    glVertex2d(-0.08, 0.5); // Левая верхняя вершина

    glColor3ub(225,225,225);
    glVertex2d(-0.12, 0.46); // Левая нижняя вершина
    glVertex2d(-0.16, 0.46); // Правая нижняя вершина
    glVertex2d(-0.16, 0.5); // Правая верхняя вершина
    glVertex2d(-0.12, 0.5); // Левая верхняя вершина

    glColor3ub(225,225,225);
    glVertex2d(-0.16, 0.46); // Левая нижняя вершина
    glVertex2d(-0.2, 0.46); // Правая нижняя вершина
    glVertex2d(-0.2, 0.5); // Правая верхняя вершина
    glVertex2d(-0.16, 0.5); // Левая верхняя вершина

    glColor3ub(225,225,225);
    glVertex2d(-0.2, 0.46); // Левая нижняя вершина
    glVertex2d(-0.24, 0.46); // Правая нижняя вершина
    glVertex2d(-0.24, 0.5); // Правая верхняя вершина
    glVertex2d(-0.2, 0.5); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.24, 0.46); // Левая нижняя вершина
    glVertex2d(-0.28, 0.46); // Правая нижняя вершина
    glVertex2d(-0.28, 0.5); // Правая верхняя вершина
    glVertex2d(-0.24, 0.5); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.24, 0.46); // Левая нижняя вершина
    glVertex2d(-0.28, 0.46); // Правая нижняя вершина
    glVertex2d(-0.28, 0.5); // Правая верхняя вершина
    glVertex2d(-0.24, 0.5); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.28, 0.46); // Левая нижняя вершина
    glVertex2d(-0.32, 0.46); // Правая нижняя вершина
    glVertex2d(-0.32, 0.5); // Правая верхняя вершина
    glVertex2d(-0.28, 0.5); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.32, 0.46); // Левая нижняя вершина
    glVertex2d(-0.36, 0.46); // Правая нижняя вершина
    glVertex2d(-0.36, 0.5); // Правая верхняя вершина
    glVertex2d(-0.32, 0.5); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.36, 0.46); // Левая нижняя вершина
    glVertex2d(-0.32, 0.46); // Правая нижняя вершина
    glVertex2d(-0.32, 0.5); // Правая верхняя вершина
    glVertex2d(-0.36, 0.5); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.4, 0.46); // Левая нижняя вершина
    glVertex2d(-0.36, 0.46); // Правая нижняя вершина
    glVertex2d(-0.36, 0.5); // Правая верхняя вершина
    glVertex2d(-0.4, 0.5); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.44, 0.46); // Левая нижняя вершина
    glVertex2d(-0.4, 0.46); // Правая нижняя вершина
    glVertex2d(-0.4, 0.5); // Правая верхняя вершина
    glVertex2d(-0.44, 0.5); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.48, 0.46); // Левая нижняя вершина
    glVertex2d(-0.44, 0.46); // Правая нижняя вершина
    glVertex2d(-0.44, 0.5); // Правая верхняя вершина
    glVertex2d(-0.48, 0.5); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.52, 0.46); // Левая нижняя вершина
    glVertex2d(-0.48, 0.46); // Правая нижняя вершина
    glVertex2d(-0.48, 0.5); // Правая верхняя вершина
    glVertex2d(-0.52, 0.5); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.4, 0.42); // Левая нижняя вершина
    glVertex2d(0.36, 0.42); // Правая нижняя вершина
    glVertex2d(0.36, 0.46); // Правая верхняя вершина
    glVertex2d(0.4, 0.46); // Левая верхняя вершина

    glColor3ub(190,190,190);
    glVertex2d(0.36, 0.42); // Левая нижняя вершина
    glVertex2d(0.32, 0.42); // Правая нижняя вершина
    glVertex2d(0.32, 0.46); // Правая верхняя вершина
    glVertex2d(0.36, 0.46); // Левая верхняя вершина

    glColor3ub(190,190,190);
    glVertex2d(0.32, 0.42); // Левая нижняя вершина
    glVertex2d(0.28, 0.42); // Правая нижняя вершина
    glVertex2d(0.28, 0.46); // Правая верхняя вершина
    glVertex2d(0.32, 0.46); // Левая верхняя вершина

    glColor3ub(231,231,231);
    glVertex2d(0.28, 0.42); // Левая нижняя вершина
    glVertex2d(0.24, 0.42); // Правая нижняя вершина
    glVertex2d(0.24, 0.46); // Правая верхняя вершина
    glVertex2d(0.28, 0.46); // Левая верхняя вершина

    glColor3ub(231,231,231);
    glVertex2d(0.24, 0.42); // Левая нижняя вершина
    glVertex2d(0.2, 0.42); // Правая нижняя вершина
    glVertex2d(0.2, 0.46); // Правая верхняя вершина
    glVertex2d(0.24, 0.46); // Левая верхняя вершина

    glColor3ub(231,231,231);
    glVertex2d(0.2, 0.42); // Левая нижняя вершина
    glVertex2d(0.16, 0.42); // Правая нижняя вершина
    glVertex2d(0.16, 0.46); // Правая верхняя вершина
    glVertex2d(0.2, 0.46); // Левая верхняя вершина

    glColor3ub(231,231,231);
    glVertex2d(0.16, 0.42); // Левая нижняя вершина
    glVertex2d(0.12, 0.42); // Правая нижняя вершина
    glVertex2d(0.12, 0.46); // Правая верхняя вершина
    glVertex2d(0.16, 0.46); // Левая верхняя вершина

    glColor3ub(231,231,231);
    glVertex2d(0.12, 0.42); // Левая нижняя вершина
    glVertex2d(0.08, 0.42); // Правая нижняя вершина
    glVertex2d(0.08, 0.46); // Правая верхняя вершина
    glVertex2d(0.12, 0.46); // Левая верхняя вершина

    glColor3ub(231,231,231);
    glVertex2d(0.08, 0.42); // Левая нижняя вершина
    glVertex2d(0.04, 0.42); // Правая нижняя вершина
    glVertex2d(0.04, 0.46); // Правая верхняя вершина
    glVertex2d(0.08, 0.46); // Левая верхняя вершина

    glColor3ub(231,231,231);
    glVertex2d(0.04, 0.42); // Левая нижняя вершина
    glVertex2d(0, 0.42); // Правая нижняя вершина
    glVertex2d(0, 0.46); // Правая верхняя вершина
    glVertex2d(0.04, 0.46); // Левая верхняя вершина

    glColor3ub(231,231,231);
    glVertex2d(0, 0.42); // Левая нижняя вершина
    glVertex2d(-0.04, 0.42); // Правая нижняя вершина
    glVertex2d(-0.04, 0.46); // Правая верхняя вершина
    glVertex2d(0, 0.46); // Левая верхняя вершина

    glColor3ub(231,231,231);
    glVertex2d(-0.04, 0.42); // Левая нижняя вершина
    glVertex2d(-0.08, 0.42); // Правая нижняя вершина
    glVertex2d(-0.08, 0.46); // Правая верхняя вершина
    glVertex2d(-0.04, 0.46); // Левая верхняя вершина

    glColor3ub(231,231,231);
    glVertex2d(-0.08, 0.42); // Левая нижняя вершина
    glVertex2d(-0.12, 0.42); // Правая нижняя вершина
    glVertex2d(-0.12, 0.46); // Правая верхняя вершина
    glVertex2d(-0.08, 0.46); // Левая верхняя вершина

    glColor3ub(231,231,231);
    glVertex2d(-0.12, 0.42); // Левая нижняя вершина
    glVertex2d(-0.16, 0.42); // Правая нижняя вершина
    glVertex2d(-0.16, 0.46); // Правая верхняя вершина
    glVertex2d(-0.12, 0.46); // Левая верхняя вершина

    glColor3ub(231,231,231);
    glVertex2d(-0.16, 0.42); // Левая нижняя вершина
    glVertex2d(-0.2, 0.42); // Правая нижняя вершина
    glVertex2d(-0.2, 0.46); // Правая верхняя вершина
    glVertex2d(-0.16, 0.46); // Левая верхняя вершина

    glColor3ub(231,231,231);
    glVertex2d(-0.2, 0.42); // Левая нижняя вершина
    glVertex2d(-0.24, 0.42); // Правая нижняя вершина
    glVertex2d(-0.24, 0.46); // Правая верхняя вершина
    glVertex2d(-0.2, 0.46); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.24, 0.42); // Левая нижняя вершина
    glVertex2d(-0.28, 0.42); // Правая нижняя вершина
    glVertex2d(-0.28, 0.46); // Правая верхняя вершина
    glVertex2d(-0.24, 0.46); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.24, 0.42); // Левая нижняя вершина
    glVertex2d(-0.28, 0.42); // Правая нижняя вершина
    glVertex2d(-0.28, 0.46); // Правая верхняя вершина
    glVertex2d(-0.24, 0.46); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.28, 0.42); // Левая нижняя вершина
    glVertex2d(-0.32, 0.42); // Правая нижняя вершина
    glVertex2d(-0.32, 0.46); // Правая верхняя вершина
    glVertex2d(-0.28, 0.46); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.32, 0.42); // Левая нижняя вершина
    glVertex2d(-0.36, 0.42); // Правая нижняя вершина
    glVertex2d(-0.36, 0.46); // Правая верхняя вершина
    glVertex2d(-0.32, 0.46); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.36, 0.42); // Левая нижняя вершина
    glVertex2d(-0.32, 0.42); // Правая нижняя вершина
    glVertex2d(-0.32, 0.46); // Правая верхняя вершина
    glVertex2d(-0.36, 0.46); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.4, 0.42); // Левая нижняя вершина
    glVertex2d(-0.36, 0.42); // Правая нижняя вершина
    glVertex2d(-0.36, 0.46); // Правая верхняя вершина
    glVertex2d(-0.4, 0.46); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.44, 0.42); // Левая нижняя вершина
    glVertex2d(-0.4, 0.42); // Правая нижняя вершина
    glVertex2d(-0.4, 0.46); // Правая верхняя вершина
    glVertex2d(-0.44, 0.46); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.48, 0.42); // Левая нижняя вершина
    glVertex2d(-0.44, 0.42); // Правая нижняя вершина
    glVertex2d(-0.44, 0.46); // Правая верхняя вершина
    glVertex2d(-0.48, 0.46); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.52, 0.42); // Левая нижняя вершина
    glVertex2d(-0.48, 0.42); // Правая нижняя вершина
    glVertex2d(-0.48, 0.46); // Правая верхняя вершина
    glVertex2d(-0.52, 0.46); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.36, 0.38); // Левая нижняя вершина
    glVertex2d(0.32, 0.38); // Правая нижняя вершина
    glVertex2d(0.32, 0.42); // Правая верхняя вершина
    glVertex2d(0.36, 0.42); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.32, 0.38); // Левая нижняя вершина
    glVertex2d(0.28, 0.38); // Правая нижняя вершина
    glVertex2d(0.28, 0.42); // Правая верхняя вершина
    glVertex2d(0.32, 0.42); // Левая верхняя вершина

    glColor3ub(190,190,190);
    glVertex2d(0.28, 0.38); // Левая нижняя вершина
    glVertex2d(0.24, 0.38); // Правая нижняя вершина
    glVertex2d(0.24, 0.42); // Правая верхняя вершина
    glVertex2d(0.28, 0.42); // Левая верхняя вершина

    glColor3ub(190,190,190);
    glVertex2d(0.24, 0.38); // Левая нижняя вершина
    glVertex2d(0.2, 0.38); // Правая нижняя вершина
    glVertex2d(0.2, 0.42); // Правая верхняя вершина
    glVertex2d(0.24, 0.42); // Левая верхняя вершина

    glColor3ub(190,190,190);
    glVertex2d(0.2, 0.38); // Левая нижняя вершина
    glVertex2d(0.16, 0.38); // Правая нижняя вершина
    glVertex2d(0.16, 0.42); // Правая верхняя вершина
    glVertex2d(0.2, 0.42); // Левая верхняя вершина

    glColor3ub(222,222,222);
    glVertex2d(0.16, 0.38); // Левая нижняя вершина
    glVertex2d(0.12, 0.38); // Правая нижняя вершина
    glVertex2d(0.12, 0.42); // Правая верхняя вершина
    glVertex2d(0.16, 0.42); // Левая верхняя вершина

    glColor3ub(222,222,222);
    glVertex2d(0.12, 0.38); // Левая нижняя вершина
    glVertex2d(0.08, 0.38); // Правая нижняя вершина
    glVertex2d(0.08, 0.42); // Правая верхняя вершина
    glVertex2d(0.12, 0.42); // Левая верхняя вершина

    glColor3ub(222,222,222);
    glVertex2d(0.08, 0.38); // Левая нижняя вершина
    glVertex2d(0.04, 0.38); // Правая нижняя вершина
    glVertex2d(0.04, 0.42); // Правая верхняя вершина
    glVertex2d(0.08, 0.42); // Левая верхняя вершина

    glColor3ub(222,222,222);
    glVertex2d(0.04, 0.38); // Левая нижняя вершина
    glVertex2d(0, 0.38); // Правая нижняя вершина
    glVertex2d(0, 0.42); // Правая верхняя вершина
    glVertex2d(0.04, 0.42); // Левая верхняя вершина

    glColor3ub(222,222,222);
    glVertex2d(0, 0.38); // Левая нижняя вершина
    glVertex2d(-0.04, 0.38); // Правая нижняя вершина
    glVertex2d(-0.04, 0.42); // Правая верхняя вершина
    glVertex2d(0, 0.42); // Левая верхняя вершина

    glColor3ub(222,222,222);
    glVertex2d(-0.04, 0.38); // Левая нижняя вершина
    glVertex2d(-0.08, 0.38); // Правая нижняя вершина
    glVertex2d(-0.08, 0.42); // Правая верхняя вершина
    glVertex2d(-0.04, 0.42); // Левая верхняя вершина

    glColor3ub(222,222,222);
    glVertex2d(-0.08, 0.38); // Левая нижняя вершина
    glVertex2d(-0.12, 0.38); // Правая нижняя вершина
    glVertex2d(-0.12, 0.42); // Правая верхняя вершина
    glVertex2d(-0.08, 0.42); // Левая верхняя вершина

    glColor3ub(222,222,222);
    glVertex2d(-0.12, 0.38); // Левая нижняя вершина
    glVertex2d(-0.16, 0.38); // Правая нижняя вершина
    glVertex2d(-0.16, 0.42); // Правая верхняя вершина
    glVertex2d(-0.12, 0.42); // Левая верхняя вершина

    glColor3ub(222,222,222);
    glVertex2d(-0.16, 0.38); // Левая нижняя вершина
    glVertex2d(-0.2, 0.38); // Правая нижняя вершина
    glVertex2d(-0.2, 0.42); // Правая верхняя вершина
    glVertex2d(-0.16, 0.42); // Левая верхняя вершина

    glColor3ub(222,222,222);
    glVertex2d(-0.2, 0.38); // Левая нижняя вершина
    glVertex2d(-0.24, 0.38); // Правая нижняя вершина
    glVertex2d(-0.24, 0.42); // Правая верхняя вершина
    glVertex2d(-0.2, 0.42); // Левая верхняя вершина

    glColor3ub(222,222,222);
    glVertex2d(-0.24, 0.38); // Левая нижняя вершина
    glVertex2d(-0.28, 0.38); // Правая нижняя вершина
    glVertex2d(-0.28, 0.42); // Правая верхняя вершина
    glVertex2d(-0.24, 0.42); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.24, 0.42); // Левая нижняя вершина
    glVertex2d(-0.28, 0.42); // Правая нижняя вершина
    glVertex2d(-0.28, 0.38); // Правая верхняя вершина
    glVertex2d(-0.24, 0.38); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.28, 0.38); // Левая нижняя вершина
    glVertex2d(-0.32, 0.38); // Правая нижняя вершина
    glVertex2d(-0.32, 0.42); // Правая верхняя вершина
    glVertex2d(-0.28, 0.42); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.32, 0.38); // Левая нижняя вершина
    glVertex2d(-0.36, 0.38); // Правая нижняя вершина
    glVertex2d(-0.36, 0.42); // Правая верхняя вершина
    glVertex2d(-0.32, 0.42); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.36, 0.38); // Левая нижняя вершина
    glVertex2d(-0.32, 0.38); // Правая нижняя вершина
    glVertex2d(-0.32, 0.42); // Правая верхняя вершина
    glVertex2d(-0.36, 0.42); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.4, 0.38); // Левая нижняя вершина
    glVertex2d(-0.36, 0.38); // Правая нижняя вершина
    glVertex2d(-0.36, 0.42); // Правая верхняя вершина
    glVertex2d(-0.4, 0.42); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.44, 0.38); // Левая нижняя вершина
    glVertex2d(-0.4, 0.38); // Правая нижняя вершина
    glVertex2d(-0.4, 0.42); // Правая верхняя вершина
    glVertex2d(-0.44, 0.42); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.48, 0.38); // Левая нижняя вершина
    glVertex2d(-0.44, 0.38); // Правая нижняя вершина
    glVertex2d(-0.44, 0.42); // Правая верхняя вершина
    glVertex2d(-0.48, 0.42); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.52, 0.38); // Левая нижняя вершина
    glVertex2d(-0.48, 0.38); // Правая нижняя вершина
    glVertex2d(-0.48, 0.42); // Правая верхняя вершина
    glVertex2d(-0.52, 0.42); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.28, 0.34); // Левая нижняя вершина
    glVertex2d(0.24, 0.34); // Правая нижняя вершина
    glVertex2d(0.24, 0.38); // Правая верхняя вершина
    glVertex2d(0.28, 0.38); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.24, 0.34); // Левая нижняя вершина
    glVertex2d(0.2, 0.34); // Правая нижняя вершина
    glVertex2d(0.2, 0.38); // Правая верхняя вершина
    glVertex2d(0.24, 0.38); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.2, 0.34); // Левая нижняя вершина
    glVertex2d(0.16, 0.34); // Правая нижняя вершина
    glVertex2d(0.16, 0.38); // Правая верхняя вершина
    glVertex2d(0.2, 0.38); // Левая верхняя вершина

    glColor3ub(190,190,190);
    glVertex2d(0.16, 0.34); // Левая нижняя вершина
    glVertex2d(0.12, 0.34); // Правая нижняя вершина
    glVertex2d(0.12, 0.38); // Правая верхняя вершина
    glVertex2d(0.16, 0.38); // Левая верхняя вершина

    glColor3ub(190,190,190);
    glVertex2d(0.12, 0.34); // Левая нижняя вершина
    glVertex2d(0.08, 0.34); // Правая нижняя вершина
    glVertex2d(0.08, 0.38); // Правая верхняя вершина
    glVertex2d(0.12, 0.38); // Левая верхняя вершина

    glColor3ub(190,190,190);
    glVertex2d(0.08, 0.34); // Левая нижняя вершина
    glVertex2d(0.04, 0.34); // Правая нижняя вершина
    glVertex2d(0.04, 0.38); // Правая верхняя вершина
    glVertex2d(0.08, 0.38); // Левая верхняя вершина

    glColor3ub(190,190,190);
    glVertex2d(0.04, 0.34); // Левая нижняя вершина
    glVertex2d(0, 0.34); // Правая нижняя вершина
    glVertex2d(0, 0.38); // Правая верхняя вершина
    glVertex2d(0.04, 0.38); // Левая верхняя вершина

    glColor3ub(190,190,190);
    glVertex2d(0, 0.34); // Левая нижняя вершина
    glVertex2d(-0.04, 0.34); // Правая нижняя вершина
    glVertex2d(-0.04, 0.38); // Правая верхняя вершина
    glVertex2d(0, 0.38); // Левая верхняя вершина

    glColor3ub(190,190,190);
    glVertex2d(-0.04, 0.34); // Левая нижняя вершина
    glVertex2d(-0.08, 0.34); // Правая нижняя вершина
    glVertex2d(-0.08, 0.38); // Правая верхняя вершина
    glVertex2d(-0.04, 0.38); // Левая верхняя вершина

    glColor3ub(190,190,190);
    glVertex2d(-0.08, 0.34); // Левая нижняя вершина
    glVertex2d(-0.12, 0.34); // Правая нижняя вершина
    glVertex2d(-0.12, 0.38); // Правая верхняя вершина
    glVertex2d(-0.08, 0.38); // Левая верхняя вершина

    glColor3ub(190,190,190);
    glVertex2d(-0.12, 0.34); // Левая нижняя вершина
    glVertex2d(-0.16, 0.34); // Правая нижняя вершина
    glVertex2d(-0.16, 0.38); // Правая верхняя вершина
    glVertex2d(-0.12, 0.38); // Левая верхняя вершина

    glColor3ub(190,190,190);
    glVertex2d(-0.16, 0.34); // Левая нижняя вершина
    glVertex2d(-0.2, 0.34); // Правая нижняя вершина
    glVertex2d(-0.2, 0.38); // Правая верхняя вершина
    glVertex2d(-0.16, 0.38); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.2, 0.34); // Левая нижняя вершина
    glVertex2d(-0.24, 0.34); // Правая нижняя вершина
    glVertex2d(-0.24, 0.38); // Правая верхняя вершина
    glVertex2d(-0.2, 0.38); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.24, 0.34); // Левая нижняя вершина
    glVertex2d(-0.28, 0.34); // Правая нижняя вершина
    glVertex2d(-0.28, 0.38); // Правая верхняя вершина
    glVertex2d(-0.24, 0.38); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.24, 0.34); // Левая нижняя вершина
    glVertex2d(-0.28, 0.34); // Правая нижняя вершина
    glVertex2d(-0.28, 0.38); // Правая верхняя вершина
    glVertex2d(-0.24, 0.38); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.52, 0.34); // Левая нижняя вершина
    glVertex2d(-0.48, 0.34); // Правая нижняя вершина
    glVertex2d(-0.48, 0.38); // Правая верхняя вершина
    glVertex2d(-0.52, 0.38); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.16, 0.3); // Левая нижняя вершина
    glVertex2d(0.12, 0.3); // Правая нижняя вершина
    glVertex2d(0.12, 0.34); // Правая верхняя вершина
    glVertex2d(0.16, 0.34); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.12, 0.3); // Левая нижняя вершина
    glVertex2d(0.08, 0.3); // Правая нижняя вершина
    glVertex2d(0.08, 0.34); // Правая верхняя вершина
    glVertex2d(0.12, 0.34); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.08, 0.3); // Левая нижняя вершина
    glVertex2d(0.04, 0.3); // Правая нижняя вершина
    glVertex2d(0.04, 0.34); // Правая верхняя вершина
    glVertex2d(0.08, 0.34); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0.04, 0.3); // Левая нижняя вершина
    glVertex2d(0, 0.3); // Правая нижняя вершина
    glVertex2d(0, 0.34); // Правая верхняя вершина
    glVertex2d(0.04, 0.34); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(0, 0.3); // Левая нижняя вершина
    glVertex2d(-0.04, 0.3); // Правая нижняя вершина
    glVertex2d(-0.04, 0.34); // Правая верхняя вершина
    glVertex2d(0, 0.34); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.04, 0.3); // Левая нижняя вершина
    glVertex2d(-0.08, 0.3); // Правая нижняя вершина
    glVertex2d(-0.08, 0.34); // Правая верхняя вершина
    glVertex2d(-0.04, 0.34); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.08, 0.3); // Левая нижняя вершина
    glVertex2d(-0.12, 0.3); // Правая нижняя вершина
    glVertex2d(-0.12, 0.34); // Правая верхняя вершина
    glVertex2d(-0.08, 0.34); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.12, 0.3); // Левая нижняя вершина
    glVertex2d(-0.16, 0.3); // Правая нижняя вершина
    glVertex2d(-0.16, 0.34); // Правая верхняя вершина
    glVertex2d(-0.12, 0.34); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.16, 0.3); // Левая нижняя вершина
    glVertex2d(-0.2, 0.3); // Правая нижняя вершина
    glVertex2d(-0.2, 0.34); // Правая верхняя вершина
    glVertex2d(-0.16, 0.34); // Левая верхняя вершина

    glColor3ub(0, 0, 0);
    glVertex2d(-0.24, 0.3); // Левая нижняя вершина
    glVertex2d(-0.28, 0.3); // Правая нижняя вершина
    glVertex2d(-0.28, 0.34); // Правая верхняя вершина
    glVertex2d(-0.24, 0.34); // Левая верхняя вершина

    glEnd();
    glPopMatrix();
}


